"""
Задание
	Создайте в редакторе файл hello.py, в котором будет переменная name с вашим именем
	Сделайте так, чтобы при запуске скрипта значение переменной выводилось на экран
	Запустите скрипт
"""
username = 'Марина'
print(f'Значение переменной username {username}')
