"""
Задание 1
    Открыть в VSCode папку: C:\projects\lesson1\ на Windows
    Создать новый файл в редакторе и сохранить его как hello.py
    Добавьте файл код print("Привет мир!")
    Запустите программу из командной строки

Задание 2
    Доработайте hello.py, чтобы помимо "Привет мир!" она выводила на экран при помощи print:
    Cтроку "Привет программист!"
    Результат действия 2 + 2
    Результат действия 10 / 3
    Запустите программу из командной строки
"""
print(f'Привет, мир!')
print(f'Привет, программист!\nРезультат действия 2 + 2 = {2+2}\nРезультат действия 10 / 3 = {10/3}')
