"""
Урок "Отступы" indent.py
Задание
Скопируйте последний пример в файл indent.py, запустите и посмотрите что будет
"""
x = 0
while x < 10:
    print(x)
x = x + 1
