"""
Практика: Приведение типов types.py
	Выведите на экран при помощи print() результат работы:

	float('1')  # ???
	int('2.5')  # ???
	bool(1)  # ???
	bool('')  # ???
	bool(0)  # ???
"""
print(float('1'))
print(int(float('2.5')))
print(bool(1))
print(bool(''))
print(bool(0))
